# Count Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..Count Property
ExportPatternTable Class See Also
---
Count of the items contained in the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Count { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Count As Integer
	Get
```

Visual C++
---
```text
public:
property int Count {
	int get ();
}
```

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace